life/work.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>work</title>
<!-- 2018-01-08 Mon 14:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Cosven" />
</head>
<body>
<div id="content">
<h1 class="title">work</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 工作</a>
<ul>
<li><a href="#sec-1-1">1.1. 工程效率</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. <span class="todo TODO">TODO</span> 推广新版本包困难</a></li>
<li><a href="#sec-1-1-2">1.1.2. <span class="todo TODO">TODO</span> 提高部署稳定性</a></li>
<li><a href="#sec-1-1-3">1.1.3. <span class="todo TODO">TODO</span> 构建系统运维自动化</a></li>
<li><a href="#sec-1-1-4">1.1.4. PaaS</a></li>
<li><a href="#sec-1-1-5">1.1.5. 构建 and 部署</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 工作备忘录</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 工作</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>2017-12-27 13:55:06 工作，赚钱用的？
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 工程效率</h3>
<div class="outline-text-3" id="text-1-1">
<p>
PaaS、CI/CD
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> <span class="todo TODO">TODO</span> 推广新版本包困难</h4>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> <span class="todo TODO">TODO</span> 提高部署稳定性</h4>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> <span class="todo TODO">TODO</span> 构建系统运维自动化</h4>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> PaaS</h4>
</div>
<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> 构建 and 部署</h4>
<div class="outline-text-4" id="text-1-1-5">
</div><ol class="org-ol"><li><a id="sec-1-1-5-1" name="sec-1-1-5-1"></a>部署<br  /><ol class="org-ol"><li><a id="sec-1-1-5-1-1" name="sec-1-1-5-1-1"></a>灰度部署 - 解决发布稳定性问题<br  /></li>
<li><a id="sec-1-1-5-1-2" name="sec-1-1-5-1-2"></a>分支部署 - 解决线上测试、联调、验收等问题<br  /></li></ol>
</li>
<li><a id="sec-1-1-5-2" name="sec-1-1-5-2"></a>构建<br  /><ol class="org-ol"><li><a id="sec-1-1-5-2-1" name="sec-1-1-5-2-1"></a>lavie 改进<br  /><div class="outline-text-6" id="text-1-1-5-2-1">
<ol class="org-ol">
<li>运维有点问题，docker images 占用机器内存
</li>
<li>pipeline script 写起来很恶心
</li>
</ol>
</div>
</li></ol>
</li></ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 工作备忘录</h3>
<div class="outline-text-3" id="text-1-2">
</div><ol class="org-ol"><li><a id="sec-1-2-0-1" name="sec-1-2-0-1"></a><span class="done DONE">DONE</span> oauth 在前后端分离中的应用 <code>[100%]</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="work">work</span></span><br  /><div class="outline-text-5" id="text-1-2-0-1">
<ul class="org-ul">
<li><a href="https://zh.wikipedia.org/wiki/%E8%B7%A8%E7%AB%99%E8%AF%B7%E6%B1%82%E4%BC%AA%E9%80%A0-">CSRF 跨站请求伪造</a> -&gt; 重要操作不要用 GET；CSRF 保护措施（cookie 和 query 参数中带 csrf<sub>token）</sub>
</li>
</ul>
</div>


<ol class="org-ol"><li><a id="sec-1-2-0-1-1" name="sec-1-2-0-1-1"></a><span class="done DONE">DONE</span> 目前例子中实现的方案<br  /><div class="outline-text-6" id="text-1-2-0-1-1">
<ol class="org-ol">
<li>访问 <a href="http://A">http://A</a> 时，前端检测是否有 token，没有 token 就重定向到 /oauth/authorize 页面
</li>
<li>用户在 authorize 页面输入用户名和密码，如果验证成功，重定向到用户指定的 redirect<sub>url</sub> 上。
比如 /oauth/callback 上（这个页面是前端的一个页面）。（此时，页面是有 grant<sub>code</sub> 的）
</li>
<li>前端用 grant<sub>code</sub> 给后端，后端用这个 code 去 oauth 换 token。
换取成功后，后端把这个 token 保存起来。再把 token 返回给前端，前端存起来。
</li>
<li>之后，后端每次都去校验前端传过来的 token
</li>
</ol>
</div>
</li>

<li><a id="sec-1-2-0-1-2" name="sec-1-2-0-1-2"></a><span class="done DONE">DONE</span> 一般的实现方案 <code>[100%]</code><br  /><div class="outline-text-6" id="text-1-2-0-1-2">
<ol class="org-ol">
<li>设置 cookie（有安全风险）（好像比较传统）
</li>
<li>在 localStorage 中保存
</li>

<li><code>[X]</code> token 方案 vs session 方案
</li>
</ol>
<p>
token 提高了安全性，避免了额 CSRF 攻击
但是认为可以修改 token，万一踩狗屎了呢？
</p>

<ul class="org-ul">
<li><code>[X]</code> 传统 token 方案 vs JWT
</li>
</ul>
<p>
jwt 是个自包含的东西，服务端不需要去查数据库来验证这个东西是否正确。
人为不方便修改 jwt。
</p>
</div>
</li>

<li><a id="sec-1-2-0-1-3" name="sec-1-2-0-1-3"></a><span class="done DONE">DONE</span> SSO 实现方案<br  /><div class="outline-text-6" id="text-1-2-0-1-3">
<p>
思路：<a href="https://segmentfault.com/a/1190000005357718">https://segmentfault.com/a/1190000005357718</a>
</p>

<p>
A,B 是应用服务器。L 是认证服务器。
客户端存一个 L 分发下去的 session<sub>id。</sub>
A 检测客户端是否有 session<sub>id</sub><sub>a，没有让</sub> L 去验证，验证完之后，设置一个 session<sub>id</sub><sub>a。</sub>
B 同理。
</p>
</div>
</li></ol>
</li>

<li><a id="sec-1-2-0-2" name="sec-1-2-0-2"></a><span class="done DONE">DONE</span> Performance Review<br  /><div class="outline-text-5" id="text-1-2-0-2">
</div>
</li>

<li><a id="sec-1-2-0-3" name="sec-1-2-0-3"></a><span class="done DONE">DONE</span> OKR Review<br  /><div class="outline-text-5" id="text-1-2-0-3">
<p>
确认一下 OKR 细节
</p>
</div>
</li>

<li><a id="sec-1-2-0-4" name="sec-1-2-0-4"></a><span class="done DONE">DONE</span> 梳理机器人账号<br  /><div class="outline-text-5" id="text-1-2-0-4">
<p>
ZAE-386
</p>
</div>
</li>

<li><a id="sec-1-2-0-5" name="sec-1-2-0-5"></a><span class="todo TODO">TODO</span> oauth 支持获取 client 下所有的用户<br  /></li>
<li><a id="sec-1-2-0-6" name="sec-1-2-0-6"></a><span class="done DONE">DONE</span> 计算 P95 of task reserved time<br  /><div class="outline-text-5" id="text-1-2-0-6">
<p>
percentileOfSeries 配合 gauge 使用
</p>
</div>
</li>
<li><a id="sec-1-2-0-7" name="sec-1-2-0-7"></a><span class="todo TODO">TODO</span> 明确资源出错方是否生效<br  /></li>
<li><a id="sec-1-2-0-8" name="sec-1-2-0-8"></a><span class="todo TODO">TODO</span> 周报补一下 task 链接<br  /></li>
<li><a id="sec-1-2-0-9" name="sec-1-2-0-9"></a><span class="todo TODO">TODO</span> 离线任务滚动部署<br  /><div class="outline-text-5" id="text-1-2-0-9">
</div>

<ol class="org-ol"><li><a id="sec-1-2-0-9-1" name="sec-1-2-0-9-1"></a><span class="done DONE">DONE</span> 滚动部署方案<br  /><div class="outline-text-6" id="text-1-2-0-9-1">
<p>
部署就是一个发布的过程。
发包的过程，熟悉吗？发布和发包过程是不是比较类似呢？
发布和代码变更过程是不是类似呢？也有点类似 Release/Canary/ReleaseCandidate
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-2-0-9-1-1" name="sec-1-2-0-9-1-1"></a>一些基本认识（基础逻辑）<br  /><div class="outline-text-7" id="text-1-2-0-9-1-1">
<ol class="org-ol">
<li>一个版本的生命周期
</li>
</ol>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">没上线</th>
<th scope="col" class="left">灰度中</th>
<th scope="col" class="left">上线了</th>
<th scope="col" class="left">下线了</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Candidate</td>
<td class="left">Canary</td>
<td class="left">Releasd</td>
<td class="left">Destroyed</td>
</tr>
</tbody>
</table>


<p>
如果已经部署过 newbay 了
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="right">percent</td>
<td class="left">t&lt;10 gc</td>
<td class="left">release canary</td>
<td class="left">t&gt;10 gc</td>
<td class="right">total version</td>
</tr>

<tr>
<td class="left">initial</td>
<td class="right">0</td>
<td class="left">Y</td>
<td class="left">N/A</td>
<td class="left">Y</td>
<td class="right">1</td>
</tr>

<tr>
<td class="left">releasing</td>
<td class="right">0-100</td>
<td class="left">N</td>
<td class="left">Y</td>
<td class="left">N</td>
<td class="right">2</td>
</tr>

<tr>
<td class="left">released</td>
<td class="right">0-100</td>
<td class="left">N</td>
<td class="left">N</td>
<td class="left">N</td>
<td class="right">2</td>
</tr>

<tr>
<td class="left">obsolete</td>
<td class="right">0</td>
<td class="left">N</td>
<td class="left">N/A</td>
<td class="left">Y</td>
<td class="right">1</td>
</tr>
</tbody>
</table>


<p>
构建 -&gt; (Artifact) -&gt; Candidate -&gt; 测试环境 -&gt; 办公室环境 -&gt; 生产环境
DEV -&gt; Testing -&gt; tarball -&gt; alpha -&gt; beta -&gt; RC -&gt; Release
</p>

<p>
生产环境：-&gt; 灰度 -&gt; 上线。上线失败和成功
</p>

<ol class="org-ol">
<li><b>假设 Alpha 对应 Canary1，Beta 对应 Canary2</b>
</li>
</ol>
<p>
那么有三种环境：Testing/Office/Production
每个版本有几个状态：Alpha(Canary1)/Beta(Canary2)/Release(Production) - RC(正在上线的版本)
</p>

<ol class="org-ol">
<li><b>canary 应该被看做百分比，而不应该看做 stage</b>
</li>
</ol>
<p>
看做 stage 有很多麻烦&#x2026; 比如:
set<sub>stage</sub><sub>version</sub>('canary', 'xxx')  # 失败的设计
set<sub>version</sub>('Production', 'xxx', percent=20)  # 成功
</p>

<ol class="org-ol">
<li><b>一个 version 有多个 stage，stage 是 version 的属性</b>
</li>

<li>上线状态和 Stage 概念是正交，还是咋样？
</li>
</ol>

<p>
一个版本需要状态有哪些： Ready -&gt; Canary -&gt; Releasing -&gt; Released -&gt; Outdated
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">正在上线</td>
<td class="left">已经上线</td>
<td class="left">已经下线</td>
</tr>

<tr>
<td class="left">production</td>
<td class="left">RC</td>
<td class="left">Released</td>
<td class="left">Outdated</td>
</tr>

<tr>
<td class="left">canary</td>
<td class="left"><span class="underline">__</span></td>
<td class="left">Canary</td>
<td class="left">Outdated</td>
</tr>

<tr>
<td class="left">office</td>
<td class="left"><span class="underline">__</span></td>
<td class="left">office/(R)</td>
<td class="left">Outdated</td>
</tr>

<tr>
<td class="left">testing</td>
<td class="left"><span class="underline">__</span></td>
<td class="left">testing(R)</td>
<td class="left">Outdated</td>
</tr>
</tbody>
</table>

<p>
正交的缺点：
</p>
<ol class="org-ol">
<li>有些正交结果没有意义
</li>
</ol>

<p>
假设以后使用百分比：
这种情况有点问题，不能判断哪个是生产环境。（没有办法明确的表明，当前处于灰度阶段）
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">v1</td>
<td class="left">PROD</td>
<td class="left">已经上线</td>
<td class="right">20%</td>
</tr>

<tr>
<td class="left">v2</td>
<td class="left">PROD</td>
<td class="left">已经上线</td>
<td class="right">80%</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">v1</td>
<td class="left">PROD</td>
<td class="left">正在上线</td>
<td class="right">30%</td>
</tr>

<tr>
<td class="left">v2</td>
<td class="left">PROD</td>
<td class="left">已经上线</td>
<td class="right">70%</td>
</tr>
</tbody>
</table>

<p>
假设
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">v1</td>
<td class="left">PROD</td>
<td class="left">Canary</td>
<td class="right">20%</td>
</tr>

<tr>
<td class="left">v2</td>
<td class="left">PROD</td>
<td class="left">Released</td>
<td class="right">20%</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">v1</td>
<td class="left">PROD</td>
<td class="left">Releasing</td>
<td class="right">20%</td>
</tr>

<tr>
<td class="left">v2</td>
<td class="left">PROD</td>
<td class="left">Released</td>
<td class="right">80%</td>
</tr>
</tbody>
</table>
</div>
</li></ol>
</li>

<li><a id="sec-1-2-0-9-2" name="sec-1-2-0-9-2"></a><span class="todo TODO">TODO</span> 一个 stage 对应多个 version<br  /><div class="outline-text-6" id="text-1-2-0-9-2">
<ol class="org-ol">
<li>理论上可以
</li>
<li>stage<sub>version</sub><sub>map</sub> 干了啥？
</li>
<li>存在两个 production version -&gt; 没办法判断金丝雀版本是否与生产环境版本一样，没办法回滚金丝雀
<ol class="org-ol">
<li>如果只有离线任务的话，就无所谓
</li>
<li>不会滚，并进行提醒
</li>
</ol>
</li>
<li>存在两个 production 版本，部署金丝雀时，不知道该缩放哪个版本
<ol class="org-ol">
<li>只增不减（如果只有离线任务，也不会有这个问题）
</li>
</ol>
</li>
</ol>

<p>
实际证明：不太可行。一个 stage 必须要有一个主版本，
扩容的时候总不能两个都扩把？（其实两个都扩也没有多大问题把）
</p>
</div>
</li>

<li><a id="sec-1-2-0-9-3" name="sec-1-2-0-9-3"></a>兼容滚动部署 -&gt; nothing need to do<br  /></li>
<li><a id="sec-1-2-0-9-4" name="sec-1-2-0-9-4"></a><span class="todo TODO">TODO</span> 实现离线任务滚动部署<br  /></li></ol>
</li>
<li><a id="sec-1-2-0-10" name="sec-1-2-0-10"></a>部署改进<br  /><ol class="org-ol"><li><a id="sec-1-2-0-10-1" name="sec-1-2-0-10-1"></a>日志方向<br  /><div class="outline-text-6" id="text-1-2-0-10-1">
<p>
现在的日志是一个 process 对应一个日志
但理论上应该是一个 deploy 对应一个日志，然后日志分 process
</p>
</div>
</li>
<li><a id="sec-1-2-0-10-2" name="sec-1-2-0-10-2"></a>概念方向<br  /><div class="outline-text-6" id="text-1-2-0-10-2">
<p>
canary -&gt; alpha
canary2 -&gt; beta
</p>
</div>
</li>
<li><a id="sec-1-2-0-10-3" name="sec-1-2-0-10-3"></a><span class="todo TODO">TODO</span> 部署卡顿的问题<br  /></li>
<li><a id="sec-1-2-0-10-4" name="sec-1-2-0-10-4"></a><span class="todo TODO">TODO</span> bay 和 newbay 概念上的区别，流程也有区别<br  /></li></ol>
</li>
<li><a id="sec-1-2-0-11" name="sec-1-2-0-11"></a>个人反思：整理个人状态<br  /><ol class="org-ol"><li><a id="sec-1-2-0-11-1" name="sec-1-2-0-11-1"></a>2017-12-21<br  /><div class="outline-text-6" id="text-1-2-0-11-1">
<p>
<b>最近状态不好？不好在哪些方面？</b>
</p>

<ol class="org-ol">
<li>工作效率低
</li>
<li>但是时间花费不少
</li>
<li>烦恼
</li>
</ol>

<p>
效率为啥低 -&gt;
有段时间，上午自己会研究平时遇到的问题
有段时间，花了一些在折腾 emacs 上
另外，要甩锅的地方，就是提个 MR，但是流程长。另外方案也不一样
</p>
</div>
</li></ol>
</li>
<li><a id="sec-1-2-0-12" name="sec-1-2-0-12"></a><span class="done DONE">DONE</span> oauth2 杂事<br  /><div class="outline-text-5" id="text-1-2-0-12">
</div>
<ol class="org-ol"><li><a id="sec-1-2-0-12-1" name="sec-1-2-0-12-1"></a><span class="done DONE">DONE</span> 发邮件失败<br  /></li>
<li><a id="sec-1-2-0-12-2" name="sec-1-2-0-12-2"></a><span class="done DONE">DONE</span> oauth2 支持 redirect url wildcard<br  /><div class="outline-text-6" id="text-1-2-0-12-2">
</div>
</li>
<li><a id="sec-1-2-0-12-3" name="sec-1-2-0-12-3"></a><span class="done DONE">DONE</span> 同步信息时使用批量接口<br  /></li></ol>
</li>
<li><a id="sec-1-2-0-13" name="sec-1-2-0-13"></a><span class="todo TODO">TODO</span> python3.6 for jessie<br  /><div class="outline-text-5" id="text-1-2-0-13">
</div>
</li>
<li><a id="sec-1-2-0-14" name="sec-1-2-0-14"></a><span class="todo TODO">TODO</span> 部署出错，确认资源方<br  /><div class="outline-text-5" id="text-1-2-0-14">
</div>
</li></ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cosven</p>
<p class="date">Created: 2018-01-08 Mon 14:07</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
